Repository: elamaunt/SSTournamentsBot
Catalog: src/SSTournamentsBot.Api/Resources/S.*.resx
Languages: ru

# Wait_Disabled
source: > Activity won't bother you
ru: > Активности вас не побеспокоят

# Wait_Enabled
source: > You will be notified when an activity begins
ru: > Вы будете получать уведомления о начинающихся активностях
