Repository: elamaunt/SSTournamentsBot
Catalog: src/SSTournamentsBot.Api/Resources/S.*.resx
Languages: ru

# AcceptVote_Accepted
source: {0} Your vote has been counted
ru: {0} Ваш голос был учтен

# AcceptVote_AlreadyAccepted
source: {0} You have already voted
ru: {0} Вы уже проголосовали

# AcceptVote_Error
source: {0} Error during request processing
ru: {0} Ошибка во время обработка запроса

# AcceptVote_ForcedByAdmin
source: {0} concludes the vote with the administration's vote
ru: {0} завершает голосование голосом администрации.

# AcceptVote_NoPermission
source: {0} You have no right to participate in this vote
ru: {0} Вы не имеете права участвовать в этом голосовании

# AcceptVote_NoVoting
source: {0} Voting is not taking place now
ru: {0} Голосование сейчас не проводится

# AcceptVote_VotingEnded
source: {0} Voting has already ended
ru: {0} Голосования уже завершилось

# AddTime_NextEventDelayed
source: > The next event '**{0}**' is postponed to **{1}**
ru: > Следующее событие '**{0}**' отложено на **{1}**

# AddTime_NextEventSpeedUp
source: > The next event '**{0}**' is accelerated by -**{1}**
ru: > Следующее событие '**{0}**' ускорено на -**{1}**

# AddTime_NoEvents
source: > There are no scheduled events right now.
ru: > Сейчас нет запланированных событий.

# AddTime_NoMinutes
source: > No change in the time of the next event because 0 minutes is specified.
ru: > Нет изменений во времени следующего события, так как указано 0 минут.

# BanMaps_MapsUpdatedButForNextTournaments
source: > Your ban list has been successfully updated, but the changes will only be taken into account in future tournaments.
ru: > Ваш список банов успешно обновлен, но изменения будут учтены только на следующих турнирах.

# BanMaps_UpdatedSuccessfully
source: > Your ban list has been successfully updated.
ru: > Ваш список банов успешно обновлен.

# BanPlayer_Kicked
source: {0} is kicked from the activity.
ru: {0} исключен из активности.

# Bot_AccountRegisteredSuccessfully
source: Binding of the account is completed successfully. Welcome to participate in competitive bot activities. Execute the __**/play repeatedly**__ command on the channel of the event of interest to register.
ru: Привязка аккаунта завершена успешно. Добро пожаловать на участие в соревновательных активностях бота. Выполните команду __**/play повторно**__ на канале проведения интересующего события, чтобы зарегистрироваться.

# Bot_AccountRegisteredSuccessfullyHtml
source: <h1>SS Tournaments Bot by elamaunt</h1><br/><p>Account linking completed successfully. Welcome to tournaments! Repeat the play command on the tournament channel in Discord to sign up.</p>
ru: <h1>SS Tournaments Bot by elamaunt</h1><br/><p>Привязка аккаунта завершена успешно. Добро пожаловать на участие в турнирах! Выполните команду play повторно на турнирном канале в Discord, чтобы зарегистрироваться.</p>

# Bot_AreAlreadyLeftTheEvent
source: > You have already left this activity.
ru: > Вы уже покинули данную активность.

# Bot_AreNotregisteredInEvent
source: > You were not registered.
ru: > Вы не были зарегистрированы.

# Bot_CommandNotImplemented
source: This command has not yet been implemented.
ru: Данная команда еще не реализована.

# Bot_DataBaseUpdateError
source: > Failed to update the data in the database.
ru: > Не удалось обновить данные в базе.

# Bot_Greetings
source: Hello friends! **SS Tournaments Bot** is at your service and ready to hold events for you. Use **/slash** commands to register for them. Have fun playing!
ru: Привет, друзья! **SS Tournaments Bot** к вашим услугам и готов устраивать для Вас ивенты. Для регистрации на них используйте **/slash** команды. Удачной игры!**

# Bot_ImposibleToUpdateDataBase
source: > Failed to update the data in the database.
ru: > Не удалось обновить данные в базе.

# Bot_NoActiveTournament
source: > No activity.
ru: > Нет активности.

# Bot_NoEvents
source: There are no scheduled events right now.
ru: Сейчас нет запланированных событий.

# Bot_NoUserInDataBase
source: > Such a user does not exist.
ru: > Такого пользователя не существует.

# Bot_SteamIdAlreadyUsedHtml
source: Such a SteamId is already registered to another user.
ru: Такой SteamId уже зарегистрирован на другого пользователя.

# Bot_SteamIdNotFoundHtml
source: <p>Your user information could not be loaded, or the SteamId was not detected.</p>
ru: <p>Не удалось загрузить информацию о вашем пользователе, либо SteamId не был обнаружен.</p>

# Bot_TournamentInProgress
source: >>> At this point, activity is already underway.
ru: >>> В данный момент активность уже идет.

# Bot_TournamentNotStartedYet
source: >>> Activity has not yet begun.
ru: >>> Активность еще не началась

# Bot_UnknownCommand
source: Unknown command '{0}'.
ru: Неизвестная команда '{0}'.

# Bot_YouAreNotRegistered
source: > You are not registered in the system.
ru: > Вы не зарегистрированы в системе.

# Call_CalledSuccessfully
source: > Your opponent with the nickname **{0}** is summoned via private messages.
ru: > Твой оппонент под ником **{0}** вызван через личные сообщения.

# Call_DirectMessageText
source: > A player with the nickname {0} calls you to start a match. Please contact him in the chat activity channel.
ru: > Игрок под ником {0} призывает тебя начать матч. Пожалуйста, свяжись с ним в чат канале активности.

# Call_Error
source: > An error occurred when calling a player
ru: > Возникла ошибка при вызове игрока

# Call_ImposibleToComply
source: >>> Your opponent with the nickname **{0}** cannot be called. He may have left the server. >>> He will be given a technical defeat.
ru: >>> Твой оппонент под ником **{0}** не может быть вызван. Возможно, он покинул сервер. Ему будет присуждено техническое поражение.

# Call_NoOpponent
source: > At this point your opponent has not yet been identified.
ru: > В данный момент ваш оппонент еще не определен.

# Call_UserKickedFromTournament
source: > {0} is excluded from the tournament because it is unavailable.
ru: > {0} исключен из турнира, так как недоступен.

# Call_YouHaveNotActiveMatches
source: > You have no active matches at the moment.
ru: > У вас нет активных матчей в данный момент.

# CheckIn_CheckInedSuccessfully
source: > You have successfully confirmed your participation!
ru: > Вы успешно подтведили свое участие!

# CheckIn_Error
source: > There was an error
ru: > Произошла ошибка

# CheckIn_NotActiveNow
source: > There is no checkin at this time.
ru: > В данный момент чекин не проводится.

# CheckIn_YouAreAlreadyCheckined
source: > You have already confirmed your participation.
ru: > Вы уже подтведили свое участие.

# CheckIn_YouAreNotRegisteredInTheSystem
source: > You are not logged in. Use the */play* command.
ru: > Вы не зарегистрированы в системе. Используйте команду */play*.

# CheckIn_YouAreNotRegisteredInTournament
source: > You did not register for the current activity.
ru: > Вы не регистрировались на текущую активность.

# Commands_AddBots
source: Throw bots in the tournament (for tests)
ru: Закинуть ботов в турнир (для тестов)

# Commands_AddTime
source: Delays or speeds up the next event (for admins)
ru: Откладывает или ускоряет следующее событие (для админов)

# Commands_BanMaps
source: Permanently ban maps in your matches
ru: Перманентно забанить карты в своих матчах

# Commands_BanPlayer
source: Ban player
ru: Забанить игрока

# Commands_Call
source: Call your opponent to the game
ru: Позвать оппонента на игру

# Commands_Checkin
source: Confirm your participation
ru: Подтвердить свое участие

# Commands_CheckInBots
source: Checkin all bots from the tournament (for tests)
ru: Зачекинить всех ботов из турнира (для тестов)

# Commands_DeleteUser
source: Deletes user profile (for admins)
ru: Удаляет профиль пользователя (для админов)

# Commands_Drop
source: Reset the current state of the tournament (for admins)
ru: Сбросить текущее состояние турнира (для админов)

# Commands_ForceBotMatches
source: Ends active matches with bots by losing one of the bots (for tests)
ru: Завершает активные матчи с ботами проигрышем одного из ботов (для тестов)

# Commands_ForceEvent
source: Forces the following event (for admins)
ru: Форсирует следующее событие (для админов)

# Commands_Info
source: Get current information about the next event
ru: Получить текущую информацию о следующем турнире

# Commands_KickBot
source: Exclude bot from the tournament (for tests)
ru: Исключить бота из турнира (для тестов)

# Commands_KickBots
source: Exclude all bots from the tournament (for tests)
ru: Исключить всех ботов из турнира (для тестов)

# Commands_KickPlayer
source: Exclude a player from the tournament
ru: Исключить игрока из турнира

# Commands_Leave
source: Leave the activity or exclude yourself from registration
ru: Покинуть турнир или исключить себя из регистрации

# Commands_Matches
source: Output the list of active matches
ru: Вывести список активных матчей

# Commands_MyId
source: Outputs your discord user id
ru: Выводит Ваш discord user id

# Commands_Play
source: Register for an activity or change your race
ru: Зарегистрироваться на активность или сменить расу

# Commands_Players
source: Display a list of registered players
ru: Вывести список зарегистрированных игроков

# Commands_RatedUsers
source: Display a list of users with a rating (for admins)
ru: Вывести список пользователей с рейтингом (для админов)

# Commands_RebuildCommands
source: Rebuilds all bot commands (for admins)
ru: Перестраивает все команды бота (для админов)

# Commands_RefreshLeaderboard
source: Update the leaderboard (for admins)
ru: Обновить таблицу лидеров (для админов)

# Commands_RegisterUser
source: Add a user to the database (for admins)
ru: Добавить пользователя в бд (для админов)

# Commands_SetUsersScore
source: Change the rating value of the user in the database (for admins)
ru: Поменять значение рейтинга у юзера в бд (для админов)

# Commands_Start
source: Immediately starts the tournament starting with the checkin
ru: Немедленно запускает турнир начиная с чекина

# Commands_Status
source: Find out your status in this activity
ru: Узнать ваш статус в текущем турнире

# Commands_SubmitGame
source: Count the game (for tests)
ru: Засчитать игру (для тестов)

# Commands_Time
source: Displays the current time and the remaining time to the next event
ru: Выводит текущее время и оставшееся время до следующего события

# Commands_Timeline
source: Output the schedule of all scheduled events
ru: Вывести расписание всех запланированных событий

# Commands_User
source: Output user information from the database (for admins)
ru: Вывести информацию о пользователе из бд (для админов)

# Commands_Users
source: Display a list of users in the database (for admins)
ru: Вывести список пользователей в бд (для админов)

# Commands_View
source: Outputs the current tournament grid (for tests)
ru: Выводит текущую сетку турнира (для тестов)

# Commands_Vote
source: Start voting
ru: Начать голосование

# Commands_VoteAddTime
source: Start voting to add time
ru: Начать голосование на добавление времени

# Commands_VoteBan
source: Start voting to ban a user
ru: Начать голосование на бан пользователя

# Commands_VoteKick
source: Begin voting to exclude a user from the tournament
ru: Начать голосование на исключение пользователя из турнира

# Commands_Wait
source: Get/Remove 'Waiting for Tournaments' role
ru: Получить/Убрать у себя роль 'Жду турниров'

# Events_ActivityCheckinStarted
source: Attention! {0} AutoCup {1} Checkin phase has begun. All participants must run the __**/checkin**__ command on the activity channel to confirm their participation. The checkout is open until the end of the checkout, but new participants do not need to call the */checkin** command, the */play* command is enough.
ru: Внимание! Началась стадия чекина *{0} AutoCup {1}*. Всем участникам нужно выполнить команду __**/checkin**__ на канале активности для подтверждения своего участия. Длительность чек-ина {2} минут. Регистрация открыта до окончания чекина, при этом новым участникам вызов команды */checkin* не требуется, достаточно команды */play*

# Events_ActivityCompleted
source: __**{0} successfully completed**__ =========================================================
ru: __**{0} успешно завершен**__ ==================================================================================================

# Events_ActivityNotCounted
source: A winner is determined, but the tournament will not be counted, as it consists entirely of technical defeats. At least one game must be played.
ru: Определился победитель, но активность не будет засчитана, так как она полностью состоит из технических поражений. Должна быть сыграна хотя бы одна игра.

# Events_ActivityStarted
source: The activity *{0} AutoCup {1}* begins!
ru: Начинается активность *{0} AutoCup {1}*!

# Events_ArchiveHeader
source: _**{0}**__ is safely finished! Congratulations to the player named __**{1}**__. We wish the rest of you good luck in the next events!
ru: __**{0}**__ благополучно завершен! Поздравляем с победой игрока под ником __**{1}**__. Всем остальным желаем удачи на следующих активностях!

# Events_Bracket
source: Grid:
ru: Сетка:

# Events_CurrentStageMatches
source: >>> **Matches to be played in the current stage of the event:**
ru: >>> **Матчи, которые должны быть сыграны в текущей стадии:**

# Events_FastVotingForUncompletedMatch
source: >>> Quick vote on an incomplete match. Who should be awarded a technical defeat?
ru: >>> Быстрое голосование по незавершенному матчу. Кому присудить техническое поражение?

# Events_FinishedWithNoResults
source: __**{0} completed without results**__ ==================================================================================================
ru: __**{0} завершен без учета результатов**__ ==================================================================================================

# Events_FirstStageStarted
source: The first stage of the event has begun. There is a __**{0}** countdown to the end of the stage.
ru: Первая стадия турнира началась. Пошел отсчет времени __**{TimeSpan.FromMinutes(_options.StageTimeoutMinutes).PrettyPrint()}**__ до конца стадии.

# Events_FullBracket
source: Full grid:
ru: Полная сетка:

# Events_Hosts
source: --- Hosts:
ru: --- Игру хостят вот эти ребята:

# Events_LeaderboardHasBeenUpdated
source: The leaderboard has been updated.
ru: Таблица лидеров была обновлена.

# Events_LeaderBoardHeader
source: --- __**Leaderboard**__ ---
ru: --- __**Таблица лидеров**__ ---

# Events_NextEvent
source: Moscow time {0} The next event '**{1}**' will occur in **{2}**.
ru: Московское время {0} Следующее событие '**{1}**' наступит через **{2}**.

# Events_NoTournamentsToday
source: No events today :)
ru: Без турниров сегодня :)

# Events_PlayedMatches
source: >>> Played Matches:
ru: >>> Сыгранные матчи:

# Events_Relaxing
source: --- On the resting bench this time:
ru: --- На скамейке отдыхающих на этот раз:

# Events_RulesRemind
source: **Don't forget to use DowStats and an attached Steam account, otherwise the match won't count!**
ru: **Не забывайте использовать DowStats и прикрепленный Steam аккаунт, иначе матч не будет засчитан!**

# Events_SingleMatchNotFinished
source: > The only match in this stage has not yet been completed. The completion of this stage has been postponed for __**5 minutes.**__
ru: > Единственный матч в этой стадии еще не доигран. Завершение стадии отложено на __**5 минут.**__

# Events_StageCompleted
source: The stage has been successfully completed! The next stage will begin after a {0} minute break.
ru: Стадия была успешно завершена! Следующая стадия начнется после {0}-минутного перерыва.

# Events_StageCompletionDelayed
source: > Half or more matches are still to be played. The completion of the stage has been postponed for __**5 minutes**__.
ru: > Половина или более матчей еще не доиграны. Завершение стадии отложено на __**5 минут**__.

# Events_StageTimeInfo
source: A new stage has begun. There is a __**{0}**__ countdown to the end of the stage.
ru: Новая стадия началась. Пошел отсчет времени __**{0}**__ до конца стадии.

# Events_TechLoseToPlayer
source: > A technical defeat was awarded to the player with the nickname **{0}**.
ru: > Присуждено техническое поражение игроку под ником **{0}**.

# Events_TournamentCancelledNoPlayers
source: Event has been cancelled, because there are not enough participants. Next event will start when {0} participants are registered again.
ru: Активность отменена, так как участников недостаточно. Список зарегистрированных был обнулен. Следующая активность начнется, когда снова зарегистрируются {0} участника.

# Events_UnableToStartNoPlayers
source: At the moment, the activity cannot be started because there are not enough participants. Minimum number of participants is 4. The list of registered participants has been reset.
ru: В данный момент активность невозможно начать, так как участников недостаточно. Минимальное количество участников 4. Список зарегистрированных был обнулен.

# Events_VotingCancelledCauseMatchFinished
source: > The voting result is not accepted because the match has been completed.
ru: > Результат голосования не принят, так как матч был завершен.

# Events_VotingHasBeenEnded
source: > Voting is complete.
ru: > Голосование завершено.

# Events_VotingResultNotDefined
source: >>> Voting result is not accepted, because the votes are divided equally, or no one voted. But still need to make a decision, so the technical defeat is given to the player at the discretion of the bot.
ru: >>> Результат голосования не принят, так как голоса разделились поровну, либо никто не проголосовал. Но решение все равно нужно принять, поэтому техническое поражение выдается игроку на усмотрение бота.

# Events_WeGotWinner
source: A winner has been determined!
ru: Определился победитель турнира!

# Event_NextStageStarted
source: >>> The next stage begins! Generating brackets...
ru: >>> Начинается следующая стадия! Генерация сетки..

# ForceEvent_Done
source: > The following event was forced.
ru: > Следующее событие было форсировано.

# ForceEvent_NoEvents
source: > There are no scheduled events right now.
ru: > Сейчас нет запланированных событий.

# Info_NobodyRegisteredMessage
source: No one has registered yet, but you might be the first :)
ru: Пока никто не зарегистрировался, но, возможно, вы будете первым :)

# Info_RegisteredPlayers
source: Registered participants: {0}
ru: Зарегистрировано участников: {0}

# Info_TournamentType
source: Tournament type: {0}
ru: Тип турнира: {0}

# KickPlayer_AlreadyBanned
source: > The player has already been banned.
ru: > Игрок уже был забанен.

# KickPlayer_AlreadyKickedByAdmin
source: > The player has already been excluded from the activity by the administration.
ru: > Игрок уже был исключен из активности администрацией.

# KickPlayer_AlreadyLeftTheTournament
source: > The player has already left this activity.
ru: > Игрок уже покинул эту активность.

# KickPlayer_ImposibleToKickNotRegisteredPlayer
source: > You cannot exclude a player from an activity in which he is not registered.
ru: > Нельзя исключить игрока из активност, в которой он не зарегистрирован.

# KickPlayer_ImposibleToLeaveWhenAlreadyLeftByVoting
source: > You cannot leave the activity because you have already left it by voting.
ru: > Вы не можете покинуть активность, так как вы уже покинули ее путем голосования.

# KickPlayer_NotSucceded
source: > Failed to exclude a player from activity.
ru: > Не удалось исключить игрока из активности.

# KickPlayer_NoUser
source: > The user is not registered in the system.
ru: > Пользователь не зарегистрирован в системе.

# KickPlayer_PlayerLeftTournament
source: > Player **{0}** has left the activity.
ru: > Игрок **{0}** покинул активность.

# Leave_ImposibleToLeaveCauseBanned
source: > You cannot leave the activity because you have been banned.
ru: > Вы не можете покинуть активность, так как вы были забанены.

# Leave_ImposibleToLeaveCauseKickedByAdmin
source: > You cannot leave the tournament because you have been excluded from it by the administration.
ru: > Вы не можете покинуть турнир, так как вы были исключены из него администрацией.

# Leave_Successfull
source: > You have left the current activity.
ru: > Вы покинули текущую активность.

# Leave_YouAreAlreadyKickedByVoting
source: > You cannot leave the activity because you have already left it by voting.
ru: > Вы не можете покинуть активность, так как вы уже покинули ее путем голосования.

# Players_NobodyRegistered
source: No one is currently registered for the activity.
ru: В данный момент никто не зарегистрирован на активность.

# Play_ActivityStarted
source: > Activity has already begun, changes are not possible at this time.
ru: > Активность уже началась, изменения в данный момент невозможны.

# Play_AlreadyRegistered
source: >>> You are already registered for the activity. Account on DowStats: {0} Selected race: {1}
ru: >>> Вы уже зарегистрированы на активность. Аккаунт на DowStats: {0} Выбранная раса: {1}

# Play_AlreadyRegisteredButNoChanges
source: >>> You are already registered for the activity, but race change is not possible at this time. Account on DowStats: {0} Selected race: {1}
ru: >>> Вы уже зарегистрированы на активность, но смена расы на данный момент невозможна. Аккаунт на DowStats: {0} Выбранная раса: {1}

# Play_Imposible
source: > Registration failed.
ru: > Не удалось выполнить регистрацию.

# Play_InstructionsMessage
source: To participate in bot activities, you need to confirm the connection of your account with Steam. To do this, first add your Steam account to the integration in your Discord account profile settings. Make the integration publicly visible and then click the link below to confirm it. Only Steam accounts with at least 300 games played in total in the DowStats service can register for the activity.
ru: Для участия в активностях бота нужно подтвердить связь своей учетной записи со Steam. Для этого нужно сперва добавить учетную запись стим в интеграции в настройках профиля вашего Discord аккаунта. Сделать интеграцию видимой публично и затем перейти по ссылке ниже для подтверждения. Регистрироваться на активности могут только Steam аккаунты, имеющие не менее 300 сыгранных игр всего в сервисе DowStats.

# Play_NotEnoughGames
source: >>> Not enough games on your Steam account. Only Steam accounts with at least **300 games played** total in the DowStats service can register for tournaments. Return back when you have played more games :)
ru: >>> Недостаточно игр на аккаунте Steam. Регистрироваться на турнирах могут только Steam аккаунты, имеющие не менее **300 сыгранных игр** всего в сервисе DowStats. Возвращайтесь, когда наиграете больше игр :)

# Play_RegisterIntroMessage
source: >>> To register in the system, you need to attach your Steam account to your profile. Instructions are sent in personal messages.
ru: >>> Для регистрации в системе необходимо присоединить Steam аккаунт к вашему профилю. Инструкция отправлена в личные сообщения.

# Play_Successfull
source: >>> You were successfully logged into the activity. Account on DowStats: {0} Selected race: {1}
ru: >>> Вы были успешно зарегистрированы на активность. Аккаунт на DowStats: {0} Выбранная раса: {1}

# Play_SuccessfullAndChekined
source: >>> You have been successfully registered and checked in for activity. Account on DowStats: {0} Selected race: {1}
ru: >>> Вы были успешно зарегистрированы и зачекинены на активность. Аккаунт на DowStats: {0} Выбранная раса: {1}

# Scanner_MatchAccepted
source: > A victory was counted for **{0}** in the match against **{1}**. Game link: {2}
ru: > Засчитана победа **{0}** в матче против **{1}**. Ссылка на игру: {2}

# Time_NextEvent
source: The next event '**{0}**' will occur in **{1}**.
ru: Следующее событие '**{0}**' наступит через **{1}**.

# Time_Time
source: >>> Your time **<t:{0}:t>** Moscow time **{1}**
ru: >>> Ваше время **<t:{0}:t>** Московское время **{1}**
